In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("filter.csv")

In [4]:
df

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants   NaN      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0        NaN  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male                    NaN  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com         NaN
5    quasimoto   NaN    Chennai        Male    quasimoto@email.com  01/10/2023
6          NaN   NaN        NaN         NaN                    NaN         NaN
7          NaN   NaN        NaN         NaN                    NaN         NaN
8          NaN   NaN        NaN         NaN                    NaN         NaN
9          NaN   NaN        NaN         NaN                    NaN         NaN

In [5]:
df.isnull()

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False   True   False  False      False
3  False  False  False   False   True      False
4  False  False  False   False  False       True
5  False   True  False   False  False      False
6   True   True   True    True   True       True
7   True   True   True    True   True       True
8   True   True   True    True   True       True
9   True   True   True    True   True       True

In [6]:
df.isnull().sum()

Name         4
Age          6
City         5
Gender       4
Email        5
Join Date    5
dtype: int64

In [7]:
df.dropna()

      Name   Age    City Gender              Email   Join Date
0  mundane  24.0  Mumbai   Male  mundane@email.com  14/06/2022

In [8]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [9]:
df.fillna(0)

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants   0.0      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0          0  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male                      0  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com           0
5    quasimoto   0.0    Chennai        Male    quasimoto@email.com  01/10/2023
6            0   0.0          0           0                      0           0
7            0   0.0          0           0                      0           0
8            0   0.0          0           0                      0           0
9            0   0.0          0           0                      0           0

In [10]:
df["Age"].fillna(df["Age"].mean())

0    24.00
1    27.75
2    31.00
3    27.00
4    29.00
5    27.75
6    27.75
7    27.75
8    27.75
9    27.75
Name: Age, dtype: float64

In [11]:
df.fillna(method='ffill')

C:\Users\ahire\AppData\Local\Temp\ipykernel_22016\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants  24.0      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0      Delhi  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male      imoyama@email.com  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com  19/08/2020
5    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
6    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
7    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
8    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
9    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023

In [12]:
df.ffill()

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants  24.0      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0      Delhi  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male      imoyama@email.com  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com  19/08/2020
5    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
6    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
7    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
8    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023
9    quasimoto  29.0    Chennai        Male    quasimoto@email.com  01/10/2023

In [13]:
df.bfill()

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants  31.0      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0       Pune  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male        bulol@email.com  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com  01/10/2023
5    quasimoto   NaN    Chennai        Male    quasimoto@email.com  01/10/2023
6          NaN   NaN        NaN         NaN                    NaN         NaN
7          NaN   NaN        NaN         NaN                    NaN         NaN
8          NaN   NaN        NaN         NaN                    NaN         NaN
9          NaN   NaN        NaN         NaN                    NaN         NaN

In [14]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
9     True
dtype: bool

In [15]:
df.drop_duplicates()

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants   NaN      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0        NaN  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male                    NaN  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com         NaN
5    quasimoto   NaN    Chennai        Male    quasimoto@email.com  01/10/2023
6          NaN   NaN        NaN         NaN                    NaN         NaN

In [17]:
df["Name"].str.upper()

0        MUNDANE
1    SQUAREPANTS
2        IMOYAMA
3      SPONGEBOB
4          BULOL
5      QUASIMOTO
6            NaN
7            NaN
8            NaN
9            NaN
Name: Name, dtype: object

In [18]:
df

          Name   Age       City      Gender                  Email   Join Date
0      mundane  24.0     Mumbai        Male      mundane@email.com  14/06/2022
1  squarepants   NaN      Delhi      Female  squarepants@email.com  03/11/2021
2      imoyama  31.0        NaN  Non-binary      imoyama@email.com  22/01/2023
3    spongebob  27.0       Pune        Male                    NaN  19/08/2020
4        bulol  29.0  Bangalore      Female        bulol@email.com         NaN
5    quasimoto   NaN    Chennai        Male    quasimoto@email.com  01/10/2023
6          NaN   NaN        NaN         NaN                    NaN         NaN
7          NaN   NaN        NaN         NaN                    NaN         NaN
8          NaN   NaN        NaN         NaN                    NaN         NaN
9          NaN   NaN        NaN         NaN                    NaN         NaN

In [19]:
df["Gender"].str.contains("Male", case=False)

0     True
1     True
2    False
3     True
4     True
5     True
6      NaN
7      NaN
8      NaN
9      NaN
Name: Gender, dtype: object

In [20]:
df["Email"].str.split("@")

0        [mundane, email.com]
1    [squarepants, email.com]
2        [imoyama, email.com]
3                         NaN
4          [bulol, email.com]
5      [quasimoto, email.com]
6                         NaN
7                         NaN
8                         NaN
9                         NaN
Name: Email, dtype: object

In [21]:
type(df["Email"].str.split("@"))

pandas.core.series.Series

In [23]:
df["Age"] = df["Age"].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [25]:
df2 = df.dropna().copy()

In [26]:
df2

      Name   Age    City Gender              Email   Join Date
0  mundane  24.0  Mumbai   Male  mundane@email.com  14/06/2022

In [27]:
df2["Age"] = df2["Age"].astype(int)

In [28]:
df2

      Name  Age    City Gender              Email   Join Date
0  mundane   24  Mumbai   Male  mundane@email.com  14/06/2022

In [29]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, 0 to 0
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       1 non-null      object
 1   Age        1 non-null      int32
 2   City       1 non-null      object
 3   Gender     1 non-null      object
 4   Email      1 non-null      object
 5   Join Date  1 non-null      object
dtypes: int32(1), object(5)
memory usage: 52.0+ bytes

In [30]:
 df["Age Group"] = df["Age"].apply(lambda x : "Adult" if x >= 18 else "Minor")

In [31]:
df

,Name,Age,City,Gender,Email,Join Date,Age Group
0,mundane,24.0,Mumbai,Male,mundane@email.com,14/06/2022,Adult
1,squarepants,NaN,Delhi,Female,squarepants@email.com,03/11/2021,Minor
2,imoyama,31.0,NaN,Non-binary,imoyama@email.com,22/01/2023,Adult
3,spongebob,27.0,Pune,Male,NaN,19/08/2020,Adult
4,bulol,29.0,Bangalore,Female,bulol@email.com,NaN,Adult
5,quasimoto,NaN,Chennai,Male,quasimoto@email.com,01/10/2023,Minor
6,NaN,NaN,NaN,NaN,NaN,NaN,Minor
7,NaN,NaN,NaN,NaN,NaN,NaN,Minor
8,NaN,NaN,NaN,NaN,NaN,NaN,Minor
9,NaN,NaN,NaN,NaN,NaN,NaN,Minor

In [37]:
gender_map = {"Male": "M", "Female":"F","NaN":"Chakka"}
df["Gender"] = df["Gender"].map(gender_map)

In [38]:
df

,Name,Age,City,Gender,Email,Join Date,Age Group
0,mundane,24.0,Mumbai,NaN,mundane@email.com,14/06/2022,Adult
1,squarepants,NaN,Delhi,NaN,squarepants@email.com,03/11/2021,Minor
2,imoyama,31.0,NaN,NaN,imoyama@email.com,22/01/2023,Adult
3,spongebob,27.0,Pune,NaN,NaN,19/08/2020,Adult
4,bulol,29.0,Bangalore,NaN,bulol@email.com,NaN,Adult
5,quasimoto,NaN,Chennai,NaN,quasimoto@email.com,01/10/2023,Minor
6,NaN,NaN,NaN,NaN,NaN,NaN,Minor
7,NaN,NaN,NaN,NaN,NaN,NaN,Minor
8,NaN,NaN,NaN,NaN,NaN,NaN,Minor
9,NaN,NaN,NaN,NaN,NaN,NaN,Minor

In [41]:
df2["City"] = df2["City"].replace({"Mumbai":"New Delhi"})

In [42]:
df2

      Name  Age       City Gender              Email   Join Date
0  mundane   24  New Delhi   Male  mundane@email.com  14/06/2022